{
  "users": [
    {
      "id": "hjeyu12093",
      "username": "adminmaster",
      "name": "admin",
      "email": "admin@gmail.com",
      "password": "admin123",
      "isAdmin": true,
      "cart": []
    },
    {
      "id": "dlwFymhZtcefR5FjHI52o",
      "username": "mayank123",
      "name": "Mayank Pratap Singh",
      "email": "mayank@gmail.com",
      "password": "mayank",
      "isAdmin": false,
      "cart": [
        {
          "product": {
            "id": "wgb-fNXKP7lETBDSJbpxE",
            "image": "https://images.pexels.com/photos/30771925/pexels-photo-30771925.jpeg",
            "name": "Women's Oversized Patchwork Denim Jacket with Mini Dress",
            "category": "women-clothing",
            "price": "2499",
            "description": "Make a bold fashion statement with this oversized patchwork denim jacket layered over a chic charcoal-grey mini dress. The jacket features mixed denim panels, wide sleeves, and a relaxed fit, offering a blend of vintage and street-style appeal. Perfect for layering during cool days, this outfit pairs effortlessly with tights and ankle boots for a trendy, urban look."
          },
          "quantity": 1
        }
      ]
    }
  ],
  "products": [
    {
      "id": "J6zW_oSau5s55tCclEbEl",
      "image": "https://images.pexels.com/photos/90946/pexels-photo-90946.jpeg",
      "name": "Fujifilm X-T10 Mirrorless Digital Camera (Body with 18-55mm Lens)",
      "category": "electronics",
      "price": "54999",
      "description": "Capture stunning high-resolution images with the Fujifilm X-T10 Mirrorless Digital Camera. Designed for photography enthusiasts, it features a 16.3MP APS-C X-Trans CMOS II sensor and an advanced EXR Processor II for exceptional detail and color reproduction. The included Fujinon XF 18-55mm f/2.8-4 R LM OIS lens provides versatile shooting from wide-angle landscapes to close-up portraits. With fast autofocus, continuous shooting up to 8fps, and full HD 1080p video recording, this lightweight camera delivers professional performance in a compact body. Perfect for travel, events, and creative photography."
    },
    {
      "id": "f-SuZ77NgT4OWTA1y3Dn8",
      "image": "https://images.pexels.com/photos/3945667/pexels-photo-3945667.jpeg",
      "name": "Sony PlayStation Wireless Stereo Headset – Black",
      "category": "headphones",
      "price": "8499",
      "description": "Immerse yourself in rich, high-fidelity sound with the Sony PlayStation Wireless Stereo Headset. Designed specifically for PlayStation consoles, this sleek black over-ear headset delivers powerful audio and clear chat with a built-in microphone. With wireless connectivity, 7.1 virtual surround sound, and up to 8 hours of battery life, it’s perfect for intense gaming sessions. Comfortable ear cushions and a foldable design make it ideal for long hours of gameplay and easy portability. Level up your gaming audio experience today."
    },
    {
      "id": "tKb_WMVe7mYV_9hKyfBCu",
      "image": "https://images.pexels.com/photos/3765976/pexels-photo-3765976.jpeg",
      "name": "Women's Elegant White Lace-Collar Cotton Shirt",
      "category": "women-clothing",
      "price": "1499",
      "description": "Add timeless elegance to your wardrobe with this stylish white cotton shirt, featuring a delicate lace-trimmed collar and front ruffle detail. Designed with a relaxed fit, full puff sleeves, and a soft breathable fabric, it pairs perfectly with jeans or formal trousers. Ideal for office, casual outings, or semi-formal events. Stay effortlessly chic and comfortable all day."
    },
    {
      "id": "ec3oDxDV7xMd7a77givQg",
      "image": "https://images.pexels.com/photos/17630777/pexels-photo-17630777.jpeg",
      "name": "Women's High-Waisted Light Blue Skinny Jeans",
      "category": "women-clothing",
      "price": "1299",
      "description": "Step into effortless style with these high-waisted light blue skinny jeans. Crafted from a premium stretch denim blend, they offer a flattering fit, excellent comfort, and all-day wearability. The classic five-pocket design and clean finish make them a versatile choice for pairing with everything from casual tees to dressy tops. A wardrobe essential for every modern woman."
    },
    {
      "id": "aTBvbU7nZBALcfegip5z1",
      "image": "https://images.pexels.com/photos/28010102/pexels-photo-28010102.jpeg",
      "name": "Men's Classic White Slim Fit Cotton Shirt",
      "category": "men-clothing",
      "price": "1599",
      "description": "Stay sharp and stylish with this classic white slim-fit shirt, tailored for a clean and modern silhouette. Made from breathable cotton fabric, it features a crisp collar, full sleeves, and a flattering cut that's perfect for both formal and casual occasions. Pair it effortlessly with trousers or jeans for a polished look that never goes out of style."
    },
    {
      "id": "IVSm3NKDjKo6lbJoliXHX",
      "image": "https://images.pexels.com/photos/24287025/pexels-photo-24287025.jpeg",
      "name": "Women's Oversized Graphic T-Shirt – \"I'm Leaving to Smoke Weed\" Print",
      "category": "women-clothing",
      "price": "999",
      "description": "Make a bold statement with this oversized white graphic tee featuring a quirky and colorful cartoon design with the text “I’m Leaving to Smoke Weed.” Made from soft, breathable cotton, this unisex-style t-shirt offers ultimate comfort and street-style edge. Pair it with high-waisted jeans, shorts, or joggers for a relaxed, expressive look. Perfect for casual outings, concerts, or just showing off your personality."
    },
    {
      "id": "1Qu8bhzvxIbfZUS3Ana4T",
      "image": "https://images.pexels.com/photos/16156974/pexels-photo-16156974.jpeg",
      "name": "Men's Off-White Casual Cotton Shacket",
      "category": "men-clothing",
      "price": "1899",
      "description": "Stay effortlessly stylish with this off-white cotton shacket — a versatile blend of shirt and jacket. Featuring front chest pockets, button-down closure, and a relaxed fit, this lightweight layer is perfect for both casual and semi-formal looks. Wear it over a plain tee or button it up for a cleaner silhouette. Ideal for transitional weather and minimalist fashion lovers."
    },
    {
      "id": "wgb-fNXKP7lETBDSJbpxE",
      "image": "https://images.pexels.com/photos/30771925/pexels-photo-30771925.jpeg",
      "name": "Women's Oversized Patchwork Denim Jacket with Mini Dress",
      "category": "women-clothing",
      "price": "2499",
      "description": "Make a bold fashion statement with this oversized patchwork denim jacket layered over a chic charcoal-grey mini dress. The jacket features mixed denim panels, wide sleeves, and a relaxed fit, offering a blend of vintage and street-style appeal. Perfect for layering during cool days, this outfit pairs effortlessly with tights and ankle boots for a trendy, urban look."
    },
    {
      "id": "7SAE64QsGqk6J1k0k8NdF",
      "image": "https://images.pexels.com/photos/27045943/pexels-photo-27045943.jpeg",
      "name": "Men's Classic White Linen Shirt",
      "category": "men-clothing",
      "price": "1699",
      "description": "Elevate your wardrobe with this timeless white linen shirt, designed for a relaxed yet sophisticated look. Featuring two chest flap pockets, a button-up front, and rolled-up sleeves, this shirt is perfect for casual outings, office wear, or evening gatherings. The breathable linen fabric ensures all-day comfort, keeping you cool and stylish in any season."
    },
    {
      "id": "u5cuGBnCeI5u2YVRGrHT_",
      "image": "https://images.pexels.com/photos/6761971/pexels-photo-6761971.jpeg",
      "name": "Women's Elegant Floral Print Maxi Dress",
      "category": "women-clothing",
      "price": "1899",
      "description": "Step into effortless style with this elegant floral print maxi dress, featuring a flattering fit-and-flare silhouette. Made from lightweight and breathable fabric, it offers short sleeves, a tie-waist belt, and a graceful flow that moves beautifully with every step. Perfect for brunch dates, garden parties, or casual summer outings."
    },
    {
      "id": "h1o8fg4T1RGp_HW5jbDlo",
      "image": "https://images.pexels.com/photos/18742626/pexels-photo-18742626.jpeg",
      "name": "Women's White Cropped Denim Jacket",
      "category": "women-clothing",
      "price": "2299",
      "description": "Stay chic and stylish with this white cropped denim jacket, designed with a high-neck button closure and structured fit. The versatile design pairs perfectly with jeans, skirts, or dresses, making it ideal for layering in any season. Crafted from durable denim with a modern cut, it’s a must-have for a bold, street-style look."
    },
    {
      "id": "4Y5gNoWJBeAKwj8WUJNSs",
      "image": "https://images.pexels.com/photos/20487215/pexels-photo-20487215.jpeg",
      "name": "Men's Casual Black Graphic T-Shirt",
      "category": "men-clothing",
      "price": "1099",
      "description": "Keep it effortlessly cool with this black graphic t-shirt, featuring a minimal red logo detail on the chest. Made from soft and breathable cotton, it offers a relaxed fit for all-day comfort. Perfect to pair with chinos, jeans, or shorts for a laid-back, modern look."
    },
    {
      "id": "13TwUhdFaIsIH20eaH51_",
      "image": "https://images.pexels.com/photos/12606648/pexels-photo-12606648.jpeg",
      "name": "Men's Pastel Pink Hoodie",
      "category": "men-clothing",
      "price": "2499",
      "description": "Stay comfortable and stylish with this pastel pink hoodie and jogger set, perfect for casual outings or lounging at home. The hoodie features a relaxed fit with a drawstring hood and front pocket, while the matching joggers offer an elastic waistband and tapered design. Made from soft, breathable cotton blend fabric for all-day comfort."
    },
    {
      "id": "38ua9R6CmsdEpyj8CgXIW",
      "image": "https://images.pexels.com/photos/9266439/pexels-photo-9266439.jpeg",
      "name": "Men's Graphic Print T-Shirt",
      "category": "men-clothing",
      "price": "1599",
      "description": "Add an edgy vibe to your casual wardrobe with this bold graphic print t-shirt, featuring a collage of artistic designs in monochrome and muted tones. Paired with light-wash distressed jeans, this look is perfect for street-style enthusiasts. The soft cotton fabric ensures comfort, while the modern fit keeps you effortlessly stylish."
    },
    {
      "id": "y6geCZM5i7bUi-6MahKc0",
      "image": "https://images.pexels.com/photos/9558768/pexels-photo-9558768.jpeg",
      "name": "Men's Oversized Pink T-Shirt",
      "category": "men-clothing",
      "price": "1199",
      "description": " Keep it casual and trendy with this oversized pink t-shirt, designed for a relaxed fit and ultimate comfort. Made from soft, breathable cotton, it’s perfect for daily wear, lounging, or pairing with jeans and shorts for a laid-back style."
    },
    {
      "id": "RfU405icF0ZLtI2rAJiIj",
      "image": "https://images.pexels.com/photos/9558577/pexels-photo-9558577.jpeg",
      "name": "Men's Oversized Black T-Shirt",
      "category": "men-clothing",
      "price": "1199",
      "description": "A versatile wardrobe essential, this oversized black t-shirt offers a relaxed fit and minimal design for effortless styling. Crafted from soft, breathable cotton, it’s perfect for casual outings, layering, or pairing with jeans, joggers, and shorts for a timeless look."
    },
    {
      "id": "cWLR5SwCXO4-GTMxMM7BI",
      "image": "https://images.pexels.com/photos/11545748/pexels-photo-11545748.jpeg",
      "name": "Women's Casual Beige T-Shirt with Blue Overshirt",
      "category": "women-clothing",
      "price": "1399",
      "description": "chieve a laid-back yet stylish look with this beige oversized t-shirt layered under a lightweight blue button-up overshirt. Paired with classic black wide-leg trousers, this outfit is perfect for casual outings, travel days, or relaxed work environments. Crafted from soft, breathable fabric for all-day comfort."
    },
    {
      "id": "9-YA974VPoRWxXZ6zhGJ7",
      "image": "https://images.pexels.com/photos/7752673/pexels-photo-7752673.jpeg",
      "name": "Women's Classic White Button-Up Shirt ",
      "category": "women-clothing",
      "price": "1599",
      "description": "Embrace timeless style with this crisp white button-up shirt paired with relaxed-fit wide-leg blue jeans. The shirt features a clean collar, long sleeves, and a slightly oversized fit, making it perfect for both casual and smart-casual looks. Crafted from breathable cotton for comfort and ease of movement."
    },
    {
      "id": "pR-kEv2O6D_bo2wtXoery",
      "image": "https://images.pexels.com/photos/33347713/pexels-photo-33347713.jpeg",
      "name": "Women's Casual Wide-Leg Pants",
      "category": "women-clothing",
      "price": "1799",
      "description": "Achieve a relaxed yet chic look with this outfit featuring a fitted white tank top layered under an airy oversized shirt. Paired with high-waist wide-leg trousers in a dark tone, this ensemble is perfect for casual strolls, weekend outings, or travel. The breathable fabrics ensure all-day comfort, while the laid-back styling keeps it effortlessly fashionable."
    },
    {
      "id": "eGU4deN6rrqu1vbgmrlsg",
      "image": "https://images.pexels.com/photos/29116464/pexels-photo-29116464.jpeg",
      "name": "Women's White Cable-Knit Sweater",
      "category": "women-clothing",
      "price": "1999",
      "description": "Stay cozy and stylish with this white cable-knit sweater, featuring a textured pattern and a relaxed fit. Paired with a sleek black mini skirt, this outfit offers a chic contrast perfect for autumn strolls, casual outings, or coffee dates. Made from soft, warm fabric to keep you comfortable without compromising on style."
    }
  ]
}